Revit 2024 API
LineLoad.SetCurve Method
 Sets the curve for the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void SetCurve(
	Curve curve
)
Visual Basic
Public Sub SetCurve ( _
	curve As Curve _
)
Visual C++
public:
void SetCurve(
	Curve^ curve
)
Parameters
curve
Type: Autodesk.Revit.DB.Curve
Remarks
 The curve must be bounded. The curve can be:
Line
Arc
Ellipse
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The input curve is not bound. -or- The provided curve is not supported.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This LineLoad is not a hosted load. -or- This LineLoad is a constrained load.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace